## Summary

In [ ]:
1. Create Data Frame --> pd.DataFrame(pandas series/list of Dictonary/Dictonay, index = [list of row name])

2. Access Elements --> DataFrame[[column name/list of column name]]

3. Add column in DataFrame --> DataFrame[column name] = [list of values]

4. Add a row in DataFrame --> pd.concat([DataFrame, Other DataFrame])

5. Add new column that has data from the existing columns --> DataFrame[column name] = DataFrame[column name][data slices]

6. Add a new column at a specific location = dataframe.insert(loc, lebel, data)

7. Delete a column --> dataframe.pop([column name])

8. Delete multiple column --> dataframe.pop([column name list])

9. Delete rows from a column --> dataframe.drop([row name])

10. Modify the column label --> dataframe = dataframe.rename(columns = {name: new name})

11. Modify the row label --> dataframe = dataframe.rename(index = {name: new name})

12. Use existing column values as row-index --> dataframe = dateframe.set_index(column name)

## Example 1. Access elements using labels

In [36]:
import pandas as pd

In [61]:
items = [
    {'bikes': 20, 'pants': 30, 'watches': 35},
    {'watches': 10, 'glasses': 50, 'pants': 5, 'bikes': 15}
]

In [62]:
store_items = pd.DataFrame(items, index = ['store 1', 'store 2'])

In [63]:
store_items

         bikes  pants  watches  glasses
store 1     20     30       35      NaN
store 2     15      5       10     50.0

In [65]:
store_items.index

Index(['store 1', 'store 2'], dtype='object')

In [67]:
store_items.columns

Index(['bikes', 'pants', 'watches', 'glasses'], dtype='object')

In [16]:
print('How many bikes are each store:\n', store_items[['bikes']])

How many bikes are each store:
          bikes
store 1     20
store 2     15

In [18]:
print('How many bikes and pants are each store:\n', store_items[['bikes', 'pants']])

How many bikes and pants are each store:
          bikes  pants
store 1     20     30
store 2     15      5

In [21]:
print("What items are in store 1:\n", store_items.loc[['store 1']])

What items are in store 1:
          bikes  pants  watches  glasses
store 1     20     30       35      NaN

## Example 2. Add a column to an existing DataFrame

In [25]:
store_items['shirts'] = [15, 2]

In [26]:
store_items

         bikes  pants  watches  glasses  shirts
store 1     20     30       35      NaN      15
store 2     15      5       10     50.0       2

## Example 3. Add a new column based on the arithmetic operation between existing columns of a DataFrame

In [30]:
store_items['suits'] = store_items['pants'] + store_items['shirts']

In [31]:
store_items

         bikes  pants  watches  glasses  shirts  suits
store 1     20     30       35      NaN      15     45
store 2     15      5       10     50.0       2      7

## Example 4 a. Create a row to be added to the DataFrame

In [32]:
new_items = [{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4}]

In [33]:
new_store = pd.DataFrame(new_items, index = ['store 3'])

In [38]:
store_items = pd.concat([store_items, new_store])

In [39]:
store_items

         bikes  pants  watches  glasses  shirts  suits
store 1     20     30       35      NaN    15.0   45.0
store 2     15      5       10     50.0     2.0    7.0
store 3     20     30       35      4.0     NaN    NaN

## Example 5. Add new column that has data from the existing columns

In [40]:
store_items['new_watches'] = store_items['watches'][1: ]

In [41]:
store_items

         bikes  pants  watches  glasses  shirts  suits  new_watches
store 1     20     30       35      NaN    15.0   45.0          NaN
store 2     15      5       10     50.0     2.0    7.0         10.0
store 3     20     30       35      4.0     NaN    NaN         35.0

## Example 6. Add new column at a specific location

Syntax:  dataframe.insert(loc, label, data)

In [42]:
store_items.insert(4, 'shoes', [8, 5, 0])

In [43]:
store_items

         bikes  pants  watches  glasses  shoes  shirts  suits  new_watches
store 1     20     30       35      NaN      8    15.0   45.0          NaN
store 2     15      5       10     50.0      5     2.0    7.0         10.0
store 3     20     30       35      4.0      0     NaN    NaN         35.0

## Example 7. Delete one column from a DataFrame

In [45]:
store_items.pop('new_watches')

store 1     NaN
store 2    10.0
store 3    35.0
Name: new_watches, dtype: float64

In [46]:
store_items

         bikes  pants  watches  glasses  shoes  shirts  suits
store 1     20     30       35      NaN      8    15.0   45.0
store 2     15      5       10     50.0      5     2.0    7.0
store 3     20     30       35      4.0      0     NaN    NaN

## Example 8. Delete multiple columns from a DataFrame

In [47]:
store_items = store_items.drop(['watches', 'shoes'], axis=1)

In [48]:
store_items

         bikes  pants  glasses  shirts  suits
store 1     20     30      NaN    15.0   45.0
store 2     15      5     50.0     2.0    7.0
store 3     20     30      4.0     NaN    NaN

## Example 9. Delete rows from a DataFrame

In [49]:
store_items = store_items.drop(['store 2', 'store 1'], axis=0)

In [50]:
store_items

         bikes  pants  glasses  shirts  suits
store 3     20     30      4.0     NaN    NaN

## Example 10. Modify the column label

In [52]:
store_items = store_items.rename(columns = {'bikes':'hats'})

In [53]:
store_items

         hats  pants  glasses  shirts  suits
store 3    20     30      4.0     NaN    NaN

## Example 11. Modify the row label

In [54]:
store_items = store_items.rename(index = {'store 3': 'last store'})

In [55]:
store_items

            hats  pants  glasses  shirts  suits
last store    20     30      4.0     NaN    NaN

## Example 12. Use existing column values as row-index

In [56]:
store_items = store_items.set_index('pants')

In [57]:
store_items

       hats  glasses  shirts  suits
pants
30       20      4.0     NaN    NaN